%% DCT进行图像压缩
clc;
clear vars;
close all;

%% 图像分割 取均值
M=8;N=8;                            %选择长款各要分隔多少块
a=imread('a.png');                  %读取图像
[m,n,c]=size(a);                    %设定一个空三维矩阵，尺寸与a一致
means=zeros(8,8,3);                 %设定一个8x8x3的空矩阵，用于存储之后计算的图像块的均值
count=1;
for i=1:M
    for j=1:N
        block = a((i-1)*m/M+1:m/M*i,(j-1)*n/N+1:j*n/N,:);   %图像分块(32x32x3的矩阵)
        means(i,j,1:3)=mean(mean(block,2));                 %记录各块的均值
        subplot(M,N,count);                                 %分区
        imshow(block);                                      %对应打印子块
        count = count+1;
    end
end

%% 打印原图以及压缩后的图像
figure(2);
subplot(1,3,1);
imshow(a);
title('原始图像');
res = uint8(255 * mat2gray(means)); %将原本为双整型矩阵means转换为8位无符号整型变量（方便打印）
subplot(1,3,2);
imshow(res);
title('8x8的图像');

%% rgb to ycbcr
res= rgb2ycbcr(res);
subplot(1,3,3);
imshow(res);

%% DCT变换
xx=128.*ones(8,8);
M11=dct2(res(:,:,1));
M21=dct2(res(:,:,2));
M31=dct2(res(:,:,3));               %对res的三个色彩通道分别进行二维DCT变换

%% 量化矩阵以及DCT后处理
p = [16, 11, 10, 16, 24, 40, 51, 61
     12, 12, 14, 19, 26, 58, 60, 55
     14, 13, 16, 24, 40, 57, 69, 56
     14, 17, 22, 29, 51, 87, 80, 66
     18, 22, 37, 56, 68, 109, 103, 77
     24, 35, 55, 64, 81, 104, 113, 92
     49, 64, 78, 87, 103, 121, 120, 101
     72, 92, 95, 98, 112, 100, 103, 99];    %亮度量化矩阵
q = [17, 18, 24, 47, 99, 99, 99, 99
     18, 21, 26, 66, 99, 99, 99, 99
     24, 26, 56, 99, 99, 99, 99, 99
     47, 66, 99, 99, 99, 99, 99, 99
     99, 99, 99, 99, 99, 99, 99, 99
     99, 99, 99, 99, 99, 99, 99, 99
     99, 99, 99, 99, 99, 99, 99, 99
     99, 99, 99, 99, 99, 99, 99, 99];       %色度量化矩阵

M12=round(M11./p);
M22=round(M21./q);
M32=round(M31./q);                  %对三个通道分别进行亮度和色度量化，并四舍五入

%% 按照Z字形扫描 并保存
R=zeros(8,8,3);
R(:,:,1)=zTransform((M12)');
R(:,:,2)=zTransform((M22)');
R(:,:,3)=zTransform((M32)');        %利用子函数zTransform对三个已量化的DCT系数进行z型扫描

D(1,:) = reshape(R(:,:,1)',1,64);   
D(2,:) = reshape(R(:,:,2)',1,64);
D(3,:) = reshape(R(:,:,3)',1,64);   %将逆变换后的三通道分别排序，组成一个3x64的矩阵

disp(D);                            % 显示描述符

%% DCT逆变换 合并通道
M13=idct2(M12);
M23=idct2(M22);
M33=idct2(M32);                     %DCT逆变换

Pic=zeros(8,8,3);
Pic(:,:,1)=M13;
Pic(:,:,2)=M23;
Pic(:,:,3)=M33;                     %将处理后的三个矩阵合并为8x8x3的矩阵

%% 展示压缩后的图像
image = uint8(255 * mat2gray(Pic)); %将上面矩阵中的元素转换为8位无符号整型变量
image=ycbcr2rgb(image);             %重新转换为RGB色彩空间
subplot(1,3,3);                     %打印图像
imshow(image);
title('经过处理之后的图像');   

